package student_aleksandrs_padalko.lesson_2.level_1;

//Команда System.out.println("text"); выводит указанный "text"
//на консоль, и переводит курсор на новую строку.
//
//Для того, что бы выводить текст на консоль без перевода курсора на
//новую строку можно воспользоваться командой
//    System.out.print("text");
//эта команда распечатает текст на консоль и оставит курсор в той же строке.
//
//Напишите программу, которая демонстрирует использование команды
//    System.out.print("text");

import java.util.Scanner;

public class Task_15 {public static void main(String[] args)
{
    Scanner scanner = new Scanner(System.in);
    System.out.print("Text");

}
}
