package student_stanislav_astafjev.lesson_9.Task_9;

abstract class AbstractClass {
    /*
    1.Кроме обычных классов в Java есть абстрактные классы.
    Абстрактный класс похож на обычный класс.
    В абстрактном классе также можно определить поля и методы, но в то же время нельзя создать объект или экземпляр абстрактного класса.
    Абстрактные классы призваны предоставлять базовый функционал для классов-наследников.

    2.Кроме обычных классов в Java есть абстрактные классы.
     Абстрактный класс похож на обычный класс.
     В абстрактном классе также можно определить поля и методы, но в то же время нельзя создать объект или экземпляр абстрактного класса.
     */
    public abstract void abstractClassMethod();
}
